


#include <stdio.h>



//指针！


//计算机给每个“位置”，通过“地址”进行定位
//指针变量：存储地址的变量

//Q1:怎么标识一个变量的地址
//A1:使用 & 取地址
//Q2:怎么存储一个变量的地址
//A2:int* p以为，p是存放的int类型变量的地址

int* func();
void swap1(int a, int b);
void swap2(int* px, int* py);


int main()
{
	/*
	int a = 10;
	int* p = &a;//意思是p为一个整型指针变量，他存的是变量a的地址
	printf("%p\n", &a);
	printf("%p\n", p);
	*/

	/*
	================================指针初级代码=============================
	*/
	char c = 'a';
	char* pc = &c;

	//此步骤中到底*pc即为解引用
	//代表：访问当前指针变量pc中所存储的地址在内存中对应的数据
	printf("*pc = %c\n", *pc);

	//那么这样改变的就是指针变量pc指向的值
	*pc = 'k';
	printf("*pc = %c\n", *pc);
	printf("c = %c\n", c);

	short sh = 10;
	short* psh = &sh;
	//由上可知，那么此步输出的即为sh的值
	printf("*psh = %d\n", *psh);


	/*
	由上可知，解引用操作可以获取或者修改指针变量对应地址中的值
	*/

	int a = 100;
	int* pi = &a;
	printf("下方用于输出指针大小\n");
	printf("%zu\n", sizeof(pc));
	printf("%zu\n", sizeof(psh));
	printf("%zu\n", sizeof(pi));

	//由上可知，在64位系统中，理论寻址空间为8字节；即64比特位
	//在32位系统中，理论寻址空间为4字节；即32比特位

	//所以指针变量的大小和地址指向的目标类型没有关系，和操作系统 多少位 有关系





	//指针类型决定了解引用时，一次访问多少字节，以及如何解释这些字节。
	//访问指针所内存的操作，简称为“解引用”操作，使用运算符*来进行访问


	/*
	=============================指针进阶==========================
	*/

	//1、指针运算（+-整数）
	//指针变量存储的是内存当中的地址，通过指针可以访问指定地址，
	//如果指针做加减整数的操作，实际上是当前指针指向位置的相对偏移

	//case 1:
	int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };
	int* p = &arr[0];

	printf("%p\n", p);
	printf("%p\n", &arr[0]);
	/*
	====================
	*/
	printf("===============\n");

	printf("%p\n", p + 1);
	printf("%p\n", &arr[1]);

	//由上可知，p+1的值 与 &arr[1] 地址相同
	//那么p+1与p之间相差4个字节，也就是一个int大小

	//结论：指针+1 加几个字节，取决于指针对应数据的类型

	printf("%d\n", *p + 1);
	printf("%d\n", arr[1]);

	//p+1 相当于加了4个字节
	//p+2 相当于加了8个字节


	short arr2[] = { 1,2,3,4 };
	short* p2 = &arr2[0];
	/*
	====================
	*/
	printf("===============\n");

	printf("%p\n", p2);
	printf("%p\n", p2 + 1);
	printf("%p\n", &arr2[1]);

	printf("%d\n", *p2 + 1);
	printf("%d\n", arr2[1]);


	/*
	=============================指针进阶2==========================
	*/

	//指针解引用访问的进阶操作

	int n = 0x11223344;

	char* p3 = &n;
	printf("%x\n", *p3);//44
	//意味着该数据在内存中存储的方式是  44 33 22 11，即为小端
	//因为44属于低位数据，低位地址放低数据成为小端；
	//相反的，低地址处放置高位数据称为大端

	//对应解引用来说，当前指针是什么类型的指针，决定了你的访问能力
	//如果是int*类型的指针，解引用就访问四个字节


	//大小端，是计算机系统中用于描述多字节数据在内存中存储顺序的概念
	//大小端存储数据取决于系统的硬件架构，常见的x86、x64架构通常使用小端序
	//网络字节序通常使用大端序



	/*
	=============================野指针==========================
	*/
	//野指针就是，指针指向的位置是不可知的（随机的、不正确的、没有明确限制的）
	//野指针成因：
	//1、指针未初始化

	/*
	//case，此时p4未初始化，属于野指针

	int* p4;
	*p4 = 20;
	printf("*p4 = %d\n", *p4);

	*/

	//2、指针越界访问

	int arr1[10] = { 1,2,3,4,5,6,7,8,9,10 };
	int* p5 = &arr[10];
	printf("*p5 = %d\n", *p5);


	//3、指针超出作用域，指针指向的变量已经超出其生命周期

	int* ret = func();//ret是一个野指针，没有意义了，因为内存已经被释放了
	printf("ret = %d\n", *ret);


	//4、

	/*
	留待动态内存分配部分学习
	*/


	/*
	=============================如何避免野指针==========================
	*/
	//指针初始化
	//如果不知道指针应该指向哪里，可以先给指针赋值NULL


	/*
	int *p;          → 未初始化，值不确定 → 可能成为野指针
	int *p = NULL;   → 明确表示暂时不指向有效对象
	int *p = &a;     → 指向有效对象
	*/

	/*
	=============================指针传参==========================
	*/

	//Q:为什么使用指针传参？
	//A:

	int x = 10;
	int y = 20;
	printf("x = %d, y = %d\n", x, y);
	swap2(&x, &y);
	printf("x = %d, y = %d\n", x, y);


	//case 1:
	unsigned long pulArray[] = { 6,7,8,9,10 };
	unsigned long* pulPtr;

	//等同于pulPtr = &pulArray[0];
	pulPtr = pulArray;

	*(pulPtr + 3) += 3;
	printf("%d, %d\n", *pulPtr, *(pulPtr + 3));


	//case 2:
	int crr[] = { 1,2,3,4,5 };
	short* sp = (short*)crr;
	for (int i = 0;i < 4;i++)
	{
		*(sp + i) = 0;
	}
	for (int i = 0;i < 5;i++)
	{
		printf("%d ", crr[i]);
	}




	return 0;
}




//此处交换的是a，b的值，不是x，y的值
//ab是形参，ab和xy只是数值相同，修改时并未修改实参

/*
void swap1(int a, int b)
{
	int temp = a;
	a = b;
	b = temp;
}
*/
void swap2(int* px, int* py)
{
	int temp = *px;
	*px = *py;
	*py = temp;
}


int* func()
{

	int a = 10;//局部变量
	return &a;//内存被回收、释放
}




/*
	 int *p = &a;
	  ↑       ↑
	指针类型   地址


&a → 取 a 的地址
 p → 保存 a 的地址
*p → 访问 a 的值
*/