


#include <stdio.h>



//指针！


//计算机给每个“位置”，通过“地址”进行定位
//指针变量：存储地址的变量

//Q1:怎么标识一个变量的地址
//A1:使用 & 取地址
//Q2:怎么存储一个变量的地址
//A2:int* p以为，p是存放的int类型变量的地址

int* func();
void swap1(int a, int b);
void swap2(int* px, int* py);
void print_arr(int* p, int len);

int main()
{
	/*
	int a = 10;
	int* p = &a;//意思是p为一个整型指针变量，他存的是变量a的地址
	printf("%p\n", &a);
	printf("%p\n", p);
	*/

	/*
	================================指针初级代码=============================
	*/
	char c = 'a';
	char* pc = &c;

	//此步骤中到底*pc即为解引用
	//代表：访问当前指针变量pc中所存储的地址在内存中对应的数据
	printf("*pc = %c\n", *pc);

	//那么这样改变的就是指针变量pc指向的值
	*pc = 'k';
	printf("*pc = %c\n", *pc);
	printf("c = %c\n", c);

	short sh = 10;
	short* psh = &sh;
	//由上可知，那么此步输出的即为sh的值
	printf("*psh = %d\n", *psh);


	/*
	由上可知，解引用操作可以获取或者修改指针变量对应地址中的值
	*/

	int a = 100;
	int* pi = &a;
	printf("下方用于输出指针大小\n");
	printf("%zu\n", sizeof(pc));
	printf("%zu\n", sizeof(psh));
	printf("%zu\n", sizeof(pi));

	//由上可知，在64位系统中，理论寻址空间为8字节；即64比特位
	//在32位系统中，理论寻址空间为4字节；即32比特位

	//所以指针变量的大小和地址指向的目标类型没有关系，和操作系统 多少位 有关系





	//指针类型决定了解引用时，一次访问多少字节，以及如何解释这些字节。
	//访问指针所内存的操作，简称为“解引用”操作，使用运算符*来进行访问


	/*
	=============================指针进阶==========================
	*/

	//1、指针运算（+-整数）
	//指针变量存储的是内存当中的地址，通过指针可以访问指定地址，
	//如果指针做加减整数的操作，实际上是当前指针指向位置的相对偏移

	//case 1:
	int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };
	int* p = &arr[0];

	printf("%p\n", p);
	printf("%p\n", &arr[0]);
	/*
	====================
	*/
	printf("===============\n");

	printf("%p\n", p + 1);
	printf("%p\n", &arr[1]);

	//由上可知，p+1的值 与 &arr[1] 地址相同
	//那么p+1与p之间相差4个字节，也就是一个int大小

	//结论：指针+1 加几个字节，取决于指针对应数据的类型

	printf("%d\n", *p + 1);
	printf("%d\n", arr[1]);

	//p+1 相当于加了4个字节
	//p+2 相当于加了8个字节


	short arr2[] = { 1,2,3,4 };
	short* p2 = &arr2[0];
	/*
	====================
	*/
	printf("===============\n");

	printf("%p\n", p2);
	printf("%p\n", p2 + 1);
	printf("%p\n", &arr2[1]);

	printf("%d\n", *p2 + 1);
	printf("%d\n", arr2[1]);


	/*
	=============================指针进阶2==========================
	*/

	//指针解引用访问的进阶操作

	int n = 0x11223344;

	char* p3 = &n;
	printf("%x\n", *p3);//44
	//意味着该数据在内存中存储的方式是  44 33 22 11，即为小端
	//因为44属于低位数据，低位地址放低数据成为小端；
	//相反的，低地址处放置高位数据称为大端

	//对应解引用来说，当前指针是什么类型的指针，决定了你的访问能力
	//如果是int*类型的指针，解引用就访问四个字节


	//大小端，是计算机系统中用于描述多字节数据在内存中存储顺序的概念
	//大小端存储数据取决于系统的硬件架构，常见的x86、x64架构通常使用小端序
	//网络字节序通常使用大端序



	/*
	=============================野指针==========================
	*/
	//野指针就是，指针指向的位置是不可知的（随机的、不正确的、没有明确限制的）
	//野指针成因：
	//1、指针未初始化

	/*
	//case，此时p4未初始化，属于野指针

	int* p4;
	*p4 = 20;
	printf("*p4 = %d\n", *p4);

	*/

	//2、指针越界访问

	int arr1[10] = { 1,2,3,4,5,6,7,8,9,10 };
	int* p5 = &arr1[10];
	printf("*p5 = %d\n", *p5);


	//3、指针超出作用域，指针指向的变量已经超出其生命周期

	int* ret = func();//ret是一个野指针，没有意义了，因为内存已经被释放了
	printf("ret = %d\n", *ret);


	//4、

	/*
	留待动态内存分配部分学习
	*/


	/*
	=============================如何避免野指针==========================
	*/
	//指针初始化
	//如果不知道指针应该指向哪里，可以先给指针赋值NULL


	/*
	int *p;          → 未初始化，值不确定 → 可能成为野指针
	int *p = NULL;   → 明确表示暂时不指向有效对象
	int *p = &a;     → 指向有效对象
	*/

	/*
	=============================指针传参==========================
	*/

	//Q:为什么使用指针传参？
	//A:普通参数传递的是值的副本，修改形参不会直接修改实参；
	//传递变量的地址后，函数可以通过指针访问并修改原变量。

	int x = 10;
	int y = 20;
	printf("x = %d, y = %d\n", x, y);
	swap2(&x, &y);
	printf("x = %d, y = %d\n", x, y);


	//case 1:
	unsigned long pulArray[] = { 6,7,8,9,10 };
	unsigned long* pulPtr;

	//数组名：表示数组首元素的地址，比如下面
	//等同于pulPtr = &pulArray[0];
	pulPtr = pulArray;

	*(pulPtr + 3) += 3;
	printf("%d, %d\n", *pulPtr, *(pulPtr + 3));


	//case 2:
	int crr[] = { 1,2,3,4,5 };
	short* sp = (short*)crr;
	for (int i = 0;i < 4;i++)
	{
		*(sp + i) = 0;
	}
	for (int i = 0;i < 5;i++)
	{
		printf("%d ", crr[i]);
	}
	printf("\n============\n");
	/*
	=============================数组与指针详解==========================
	*/

	//1、数组和指针
	//1.1、理解数组名
	//arr表示数组首元素的地址
	//&arr表示整个数组的地址

	//case 1:
	int arr3[] = { 1,2,3,4,5 };
	int* p6 = arr3;
	printf("%d \n", *(p6 + 1));
	printf("%d \n", *(arr3 + 1));
	printf("%d \n", *(p6 + 2));
	printf("%d \n", *(arr3 + 2));

	//case 2: 使用指针的方式打印数组内容
	int arr4[] = { 1,2,3,4,5 };
	print_arr(arr4, sizeof(arr4) / sizeof(arr4[0]));



	/*
	=============================二级指针==========================
	*/

	int num = 10;
	int* np1 = &num;
	printf("\n============\n");

	//在解引用这个操作当中，*代表解引用一次，**代表两次解引用
	int** np2 = &np1;
	printf("%d\n", **np2);

	//三级指针用法类似

	/*
	=============================指针数组==========================
	*/
	//Q:指针数组是什么？是指针还是数组
	//A:存放指针的 数组

	int a1 = 10;
	int b1 = 20;
	int c1 = 30;
	int* arr5[] = { &a1,&b1,&c1 };

	//case:以下两行分别代表什么意思
	//printf("*(arr5 + 1) = %d\n", *(arr5 + 1));

	printf("*(arr5 + 1) = %p\n", *(arr5 + 1));
	//相当于输出 arr5[1],也就是&b1,所以实际上应该使用%p
	printf("**(arr5 + 1) = %d\n", **(arr5 + 1));
	//这里两次解引用，相当于输出b1的值，也就是20

	/*
	=============================数组指针==========================
	*/
	//类比指针数组，数组指针是 指针，也就是指向数组的指针
	//那么怎么表示数组的地址？  &+数组名 代表的就是整个数组的地址

	int arr6[] = { 1,2,3,4 ,5 };
	//int* p7 = &arr6;//此处写法其实有问题，“int *”与“int (*)[5]”的间接级别不同


	int (*p7)[5] = &arr6;
	//数组的长度是5 数组的类型是整型数组
	//（*p7）表示p7是一个指针,[5]代表 该指针 指向的是长度为5的数组
	//这个数组是int类型的数组

	//如果 p7+1，就要加 5×sizeof（int）个字节


	//case
	char* ch[] = { "work","at","alibaba" };
	char** pch = ch;
	pch++;//由于是指针类型，那么+1的话，其实就是+8个字节，也就是一个指针大小
	printf("*pch = %s\n", *pch);//这里*pch其实是 at的地址，但是以%s输出

	//此处注意，%s是输出字符串，
	//把参数当作字符地址，从那里逐个读取字符，直到遇到 \0
	//那么意思就是从该地址开始输出，直到\0




	/*
	===============拓展===============
	*/
	//函数指针
	//函数指针数组
	//const关键字 结合指针学习



	/*
	const 是什么？
		使用 const 限制指针能修改什么

	1、const int *p 
		意为：不能通过 p 修改它指向的值
	
	2、int *const p
		意思是：p 自己存储的地址不能改变。
	
	3、 const int *const p
		它同时限制两件事：
		- 不能通过 p 修改指向的值。
		- p 自己存储的地址不能改变。
	*/











	return 0;
}

//
void print_arr(int* p, int len)
{
	for (int i = 0;i < len;i++)
	{
		printf("%d ", *(p + i));
	}

	printf("\n");

	/*
	两种写法等价，[]的作用拓展
	for (int i = 0;i < len;i++)
	{
		printf("%d ", p[i]);
	}
	*/

}




//此处交换的是a，b的值，不是x，y的值
//ab是形参，ab和xy只是数值相同，修改时并未修改实参

/*
void swap1(int a, int b)
{
	int temp = a;
	a = b;
	b = temp;
}
*/
void swap2(int* px, int* py)
{
	int temp = *px;
	*px = *py;
	*py = temp;
}


int* func()
{

	int a = 10;//局部变量
	return &a;//内存被回收、释放
}




/*
	 int *p = &a;
	  ↑       ↑
	指针类型   地址


&a → 取 a 的地址
 p → 保存 a 的地址
*p → 访问 a 的值
*/