


#include <stdio.h>



//指针！


//计算机给每个“位置”，通过“地址”进行定位
//指针变量：存储地址的变量

//Q1:怎么标识一个变量的地址
//A1:使用 & 取地址
//Q2:怎么存储一个变量的地址
//A2:int* p以为，p是存放的int类型变量的地址




int main()
{
	/*
	int a = 10;
	int* p = &a;//意思是p为一个整型指针变量，他存的是变量a的地址
	printf("%p\n", &a);
	printf("%p\n", p);
	*/

	/*
	================================指针初级代码=============================
	*/
	char c = 'a';
	char* pc = &c;

	//此步骤中到底*pc即为解引用
	//代表：访问当前指针变量pc中所存储的地址在内存中对应的数据
	printf("*pc = %c\n", *pc);

	//那么这样改变的就是指针变量pc指向的值
	*pc = 'k';
	printf("*pc = %c\n", *pc);
	printf("c = %c\n", c);

	short sh = 10;
	short* psh = &sh;
	//由上可知，那么此步输出的即为sh的值
	printf("*psh = %d\n", *psh);


	/*
	由上可知，解引用操作可以获取或者修改指针变量对应地址中的值
	*/

	int a = 100;
	int* pi = &a;
	printf("下方用于输出指针大小\n");
	printf("%d\n", sizeof(pc));
	printf("%d\n", sizeof(psh));
	printf("%d\n", sizeof(pi));

	//由上可知，在64位系统中，理论寻址空间为8字节；即64比特位
	//在32位系统中，理论寻址空间为4字节；即32比特位

	//所以指针变量的大小和地址指向的目标类型没有关系，和操作系统 多少位 有关系





	//指针类型决定了解引用时，一次访问多少字节，以及如何解释这些字节。
	//访问指针所内存的操作，简称为“解引用”操作，使用运算符*来进行访问


	/*
	=============================指针进阶==========================
	*/

	//1、指针运算（+-整数）
	//指针变量存储的是内存当中的地址，通过指针可以访问指定地址，
	//如果指针做加减整数的操作，实际上是当前指针指向位置的相对偏移

	//case 1:
	int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };
	int* p = &arr[0];

	printf("%p\n", p);
	printf("%p\n", &arr[0]);
	/*
	====================
	*/
	printf("===============\n");

	printf("%p\n", p + 1);
	printf("%p\n", &arr[1]);

	//由上可知，p+1的值 与 &arr[1] 地址相同
	//那么p+1与p之间相差4个字节，也就是一个int大小

	//结论：指针+1 加几个字节，取决于指针对应数据的类型

	printf("%d\n", *p + 1);
	printf("%d\n", arr[1]);

	//p+1 相当于加了4个字节
	//p+2 相当于加了8个字节


	short arr2[] = { 1,2,3,4 };
	short* p2 = &arr2[0];
	/*
	====================
	*/
	printf("===============\n");

	printf("%p\n", p2);
	printf("%p\n", p2 + 1);
	printf("%p\n", &arr2[1]);

	printf("%d\n", *p2 + 1);
	printf("%d\n", arr2[1]);


	/*
	=============================指针进阶2==========================
	*/

	//指针解引用访问的进阶操作

	int n = 0x11223344;

	char* p3 = &n;
	printf("%x\n", *p3);//44
	//意味着该数据在内存中存储的方式是  44 33 22 11，即为小端
	//因为44属于低位数据，低位地址放低数据成为小端；
	//相反的，低地址处放置高位数据称为大端

	//对应解引用来说，当前指针是什么类型的指针，决定了你的访问能力
	//如果是int*类型的指针，解引用就访问四个字节


	//大小端，是计算机系统中用于描述多字节数据在内存中存储顺序的概念
	//大小端存储数据取决于系统的硬件架构，常见的x86、x64架构通常使用小端序
	//网络字节序通常使用大端序








	return 0;
}



/*
	 int *p = &a;
	  ↑       ↑
	指针类型   地址


&a → 取 a 的地址
 p → 保存 a 的地址
*p → 访问 a 的值
*/